{
  "Comment.nvim": { "branch": "master" },
  "DoxygenToolkit.vim": { "branch": "master" },
  "bufferline.nvim": { "branch": "main" },
  "coc.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "gruvbox": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazygit.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "nvim-spectre": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "rainbow": { "branch": "master" },
  "vim-ai": { "branch": "main" },
  "vim-sensible": { "branch": "master" },
  "vim-stay": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "which-key.nvim": { "branch": "main" }
}