-----------------------------------------------------------
-- todo-comments.nvim 플러그인 설정 (lazy.nvim 관리)
-----------------------------------------------------------
local todo_comments_nvim = {
	"folke/todo-comments.nvim", -- TODO, FIXME 등 주석을 하이라이트해주는 플러그인
	dependencies = { "nvim-lua/plenary.nvim" }, -- 의존성: 유틸리티 함수 제공
	config = function()
		-------------------------------------------------------
		-- 플러그인 초기화
		-------------------------------------------------------
		-- 기본 설정을 사용하여 todo-comments 플러그인을 초기화합니다.
		require("todo-comments").setup({})
	end,
}

-----------------------------------------------------------
-- 플러그인 반환
-----------------------------------------------------------
return todo_comments_nvim
